app/controllers/airplanes_controller.rb

INSERT INTO "airplanes" ("name", "rows", "created_at", "updated_at", "columns") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "784"], ["rows", 4], ["created_at", "2020-01-30 02:55:31.847643"], ["updated_at", "2020-01-30 02:55:31.847643"], ["columns", 4]]
---
  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])