app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("date", "origin", "destination", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-01-29"], ["origin", "Keivn"], ["destination", "Flight"], ["created_at", "2020-01-29 08:53:43.291954"], ["updated_at", "2020-01-29 08:53:43.291954"]]