app/controllers/users_controller.rb

INSERT INTO "users" ("name", "admin", "created_at", "updated_at", "password_digest", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 58]]
---
  def destroy
    @user = User.find(params[:id])
    if @user.present?
      @user.destroy